Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 1024, 1024, 3 0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1024, 1024, 6 1792        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1024, 1024, 6 256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 1024, 1024, 6 36928       batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 1024, 1024, 6 256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_with_indices_1 (M [(None, 512, 512, 64 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 512, 512, 64) 36928       max_pooling2d_with_indices_1[0][0
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 512, 512, 64) 256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 512, 512, 64) 36928       batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 512, 512, 64) 256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_with_indices_2 (M [(None, 256, 256, 64 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 256, 256, 64) 36928       max_pooling2d_with_indices_2[0][0
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 256, 256, 64) 256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 256, 256, 64) 36928       batch_normalization_5[0][0]      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 256, 256, 64) 256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 256, 256, 64) 36928       batch_normalization_6[0][0]      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 256, 256, 64) 256         conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_with_indices_3 (M [(None, 128, 128, 64 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 128, 64) 36928       max_pooling2d_with_indices_3[0][0
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 128, 128, 64) 256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 128, 64) 36928       batch_normalization_8[0][0]      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 128, 128, 64) 256         conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 128, 128, 64) 36928       batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 128, 128, 64) 256         conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_with_indices_4 (M [(None, 64, 64, 64), 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 64, 64, 64)   36928       max_pooling2d_with_indices_4[0][0
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 64, 64, 64)   256         conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 64, 64, 64)   36928       batch_normalization_11[0][0]     
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 64, 64, 64)   256         conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 64, 64, 64)   36928       batch_normalization_12[0][0]     
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 64, 64, 64)   256         conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_with_indices_5 (M [(None, 32, 32, 64), 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
max_unpooling2d_with_indices_1  (None, 64, 64, 64)   0           max_pooling2d_with_indices_5[0][0
                                                                 max_pooling2d_with_indices_5[0][1
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 64, 64, 64)   36928       max_unpooling2d_with_indices_1[0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 64, 64, 64)   256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 64, 64, 64)   36928       batch_normalization_14[0][0]     
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 64, 64, 64)   256         conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 64, 64, 64)   36928       batch_normalization_15[0][0]     
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 64, 64, 64)   256         conv2d_16[0][0]                  
__________________________________________________________________________________________________
max_unpooling2d_with_indices_2  (None, 128, 128, 64) 0           batch_normalization_16[0][0]     
                                                                 max_pooling2d_with_indices_4[0][1
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 128, 128, 64) 36928       max_unpooling2d_with_indices_2[0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 128, 128, 64) 256         conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 128, 128, 64) 36928       batch_normalization_17[0][0]     
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 128, 128, 64) 256         conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 128, 128, 64) 36928       batch_normalization_18[0][0]     
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 128, 128, 64) 256         conv2d_19[0][0]                  
__________________________________________________________________________________________________
max_unpooling2d_with_indices_3  (None, 256, 256, 64) 0           batch_normalization_19[0][0]     
                                                                 max_pooling2d_with_indices_3[0][1
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 256, 256, 64) 36928       max_unpooling2d_with_indices_3[0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 256, 256, 64) 256         conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 256, 256, 64) 36928       batch_normalization_20[0][0]     
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 256, 256, 64) 256         conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 256, 256, 64) 36928       batch_normalization_21[0][0]     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 256, 256, 64) 256         conv2d_22[0][0]                  
__________________________________________________________________________________________________
max_unpooling2d_with_indices_4  (None, 512, 512, 64) 0           batch_normalization_22[0][0]     
                                                                 max_pooling2d_with_indices_2[0][1
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 512, 512, 64) 36928       max_unpooling2d_with_indices_4[0]
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 512, 512, 64) 256         conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 512, 512, 64) 36928       batch_normalization_23[0][0]     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 512, 512, 64) 256         conv2d_24[0][0]                  
__________________________________________________________________________________________________
max_unpooling2d_with_indices_5  (None, 1024, 1024, 6 0           batch_normalization_24[0][0]     
                                                                 max_pooling2d_with_indices_1[0][1
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 1024, 1024, 6 36928       max_unpooling2d_with_indices_5[0]
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 1024, 1024, 6 256         conv2d_25[0][0]                  
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 1024, 1024, 6 36928       batch_normalization_25[0][0]     
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 1024, 1024, 6 256         conv2d_26[0][0]                  
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 1024, 1024, 1 577         batch_normalization_26[0][0]     
==================================================================================================
Total params: 932,225
Trainable params: 928,897
Non-trainable params: 3,328
__________________________________________________________________________________________________
